weaver/socialnetwork/evaluation/gcp/2024-08-23_16:37:49/workload.out
Running 5m test @ http://35.242.211.72:12345/wrk2-api/post/compose
  15 threads and 15 connections
  Thread calibration: mean lat.: 16.154ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 16.778ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 16.155ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 16.920ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 15.980ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 15.427ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 16.168ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 16.956ms, rate sampling interval: 48ms
  Thread calibration: mean lat.: 15.894ms, rate sampling interval: 41ms
  Thread calibration: mean lat.: 17.652ms, rate sampling interval: 52ms
  Thread calibration: mean lat.: 16.768ms, rate sampling interval: 47ms
  Thread calibration: mean lat.: 16.614ms, rate sampling interval: 45ms
  Thread calibration: mean lat.: 16.484ms, rate sampling interval: 46ms
  Thread calibration: mean lat.: 16.338ms, rate sampling interval: 43ms
  Thread calibration: mean lat.: 17.133ms, rate sampling interval: 48ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.45s    14.31s   50.53s    82.31%
    Req/Sec     8.13     11.36    42.00     69.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  442.37ms
 75.000%   15.26s 
 90.000%   34.67s 
 99.000%   50.53s 
 99.900%    0.98m 
 99.990%    1.04m 
 99.999%    1.05m 
100.000%    1.05m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      10.639     0.000000            1         1.00
      24.303     0.100000         3570         1.11
      35.871     0.200000         7129         1.25
      55.935     0.300000        10688         1.43
     107.263     0.400000        14250         1.67
     442.367     0.500000        17812         2.00
    1181.695     0.550000        19594         2.22
    3481.599     0.600000        21374         2.50
    6422.527     0.650000        23157         2.86
   10829.823     0.700000        24936         3.33
   15261.695     0.750000        26719         4.00
   17989.631     0.775000        27608         4.44
   21168.127     0.800000        28499         5.00
   23986.175     0.825000        29389         5.71
   27295.743     0.850000        30279         6.67
   30998.527     0.875000        31172         8.00
   32931.839     0.887500        31617         8.89
   34668.543     0.900000        32064        10.00
   36601.855     0.912500        32514        11.43
   38076.415     0.925000        32951        13.33
   39944.191     0.937500        33403        16.00
   40959.999     0.943750        33621        17.78
   42041.343     0.950000        33846        20.00
   42958.847     0.956250        34068        22.86
   43909.119     0.962500        34292        26.67
   45285.375     0.968750        34510        32.00
   45973.503     0.971875        34623        35.56
   46727.167     0.975000        34736        40.00
   47382.527     0.978125        34849        45.71
   48136.191     0.981250        34955        53.33
   48889.855     0.984375        35068        64.00
   49315.839     0.985938        35126        71.11
   49807.359     0.987500        35181        80.00
   50233.343     0.989062        35233        91.43
   50790.399     0.990625        35289       106.67
   51412.991     0.992188        35344       128.00
   51806.207     0.992969        35376       142.22
   52199.423     0.993750        35401       160.00
   52625.407     0.994531        35432       182.86
   53051.391     0.995313        35456       213.33
   53641.215     0.996094        35483       256.00
   53936.127     0.996484        35499       284.44
   54099.967     0.996875        35511       320.00
   54394.879     0.997266        35525       365.71
   54820.863     0.997656        35539       426.67
   55508.991     0.998047        35553       512.00
   55967.743     0.998242        35560       568.89
   56360.959     0.998437        35568       640.00
   57049.087     0.998633        35574       731.43
   58195.967     0.998828        35581       853.33
   59146.239     0.999023        35589      1024.00
   59506.687     0.999121        35591      1137.78
   59899.903     0.999219        35595      1280.00
   60325.887     0.999316        35598      1462.86
   60817.407     0.999414        35603      1706.67
   60981.247     0.999512        35605      2048.00
   61145.087     0.999561        35607      2275.56
   61243.391     0.999609        35609      2560.00
   61308.927     0.999658        35610      2925.71
   61571.071     0.999707        35612      3413.33
   61800.447     0.999756        35614      4096.00
   61833.215     0.999780        35615      4551.11
   62029.823     0.999805        35616      5120.00
   62029.823     0.999829        35616      5851.43
   62128.127     0.999854        35617      6826.67
   62291.967     0.999878        35618      8192.00
   62357.503     0.999890        35619      9102.22
   62357.503     0.999902        35619     10240.00
   62357.503     0.999915        35619     11702.86
   62488.575     0.999927        35620     13653.33
   62488.575     0.999939        35620     16384.00
   62685.183     0.999945        35621     18204.44
   62685.183     0.999951        35621     20480.00
   62685.183     0.999957        35621     23405.71
   62685.183     0.999963        35621     27306.67
   62685.183     0.999969        35621     32768.00
   62816.255     0.999973        35622     36408.89
   62816.255     1.000000        35622          inf
#[Mean    =     9451.088, StdDeviation   =    14309.338]
#[Max     =    62783.488, Total count    =        35622]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  37138 requests in 5.00m, 20.64MB read
Requests/sec:    123.80
Transfer/sec:     70.46KB
